ЖБИ_УТ11.РасширениеЖБИ/src/DataProcessors/ЖБИ_АРМРуководителя/ЖБИ_АРМРуководителя.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:DataProcessor>
  <name>ЖБИ_АРМРуководителя</name>
  <comment>ЖБИ - АРМ Руководителя</comment>
</mdclass:DataProcessor>

ЖБИ_УТ11.РасширениеЖБИ/src/InformationRegisters/ЖБИ_ПраваНастройки/ЖБИ_ПраваНастройки.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:InformationRegister>
  <name>ЖБИ_ПраваНастройки</name>
  <resources>
    <name>Значение</name>
    <type>
      <types>Characteristic.ЖБИ_ПраваНастройки</types>
    </type>
  </resources>
  <attributes>
    <name>Автор</name>
    <comment>Автор</comment>
    <type>
      <types>CatalogRef.Пользователи</types>
    </type>
  </attributes>
  <dimensions>
    <name>Объект</name>
    <type>
      <types>CatalogRef.Организации</types>
      <types>CatalogRef.СтруктураПредприятия</types>
      <types>String</types>
      <stringQualifiers>
        <length>10</length>
      </stringQualifiers>
    </type>
  </dimensions>
  <dimensions>
    <name>ПравоНастройка</name>
    <type>
      <types>ChartOfCharacteristicTypesRef.ЖБИ_ПраваНастройки</types>
    </type>
  </dimensions>
</mdclass:InformationRegister>

ЖБИ_УТ11.РасширениеЖБИ/src/DataProcessors/ЖБИ_АРМРуководителя/Forms/ФормаРедактированияПодписанта/Module.bsl
#Область ПРОЦЕДУРЫ_И_ФУНКЦИИ_ОБЩЕГО_НАЗНАЧЕНИЯ
 
 &НаСервереБезКонтекста
Функция СоздатьОбновитьЗаписиРегистраПраваНастройки(Организация,ПравоПодписи,ОтветственныйСотрудник,СообщениеОбОшибке)
	
	СтруктураПараметров = Новый Структура;
	СтруктураПараметров.Вставить("Объект",Организация);
	СтруктураПараметров.Вставить("ПравоНастройка",ПравоПодписи);
	СтруктураПараметров.Вставить("Значение",ОтветственныйСотрудник);
	СтруктураПараметров.Вставить("Автор",Пользователи.ТекущийПользователь());
	ТаблицаНабораЗаписей = РегистрыСведений.ЖБИ_ПраваНастройки.ЗаполнитьТаблицуНабораЗаписей(СтруктураПараметров);
	
	Результат = РегистрыСведений.ЖБИ_ПраваНастройки.СоздатьОбновитьЗаписиРегистраСведений(ТаблицаНабораЗаписей,,, СообщениеОбОшибке);
	Если Не Результат Тогда 
		Возврат Результат;
	КонецЕсли;
	
	Возврат Результат;
	
КонецФункции

&НаСервере
Процедура ПравоПодписиНачалоВыбораСервер(ДанныеВыбора) 
	
	ДанныеВыбора = Новый СписокЗначений; 	
	Запрос 		 = Новый Запрос;
	Запрос.Текст = "ВЫБРАТЬ
	               |	ЖБИ_ПраваНастройки.Ссылка КАК Ссылка
	               |ИЗ
	               |	ПланВидовХарактеристик.ЖБИ_ПраваНастройки КАК ЖБИ_ПраваНастройки
	               |ГДЕ
	               |	ЖБИ_ПраваНастройки.СлужебныйКод = 100";
	РезультатЗапроса = Запрос.Выполнить().Выбрать();
	Пока РезультатЗапроса.Следующий() Цикл 
		ДанныеВыбора.Добавить(РезультатЗапроса.Ссылка);	
	КонецЦикла;

КонецПроцедуры
 
 #КонецОбласти
 
 #Область ПРОЦЕДУРЫ_ОБРАБОТЧИКИ_ЭЛЕМЕНТОВ_УПРАВЛЕНИЯ_ФОРМЫ
 
&НаКлиенте
Процедура ПравоПодписиНачалоВыбора(Элемент, ДанныеВыбора, СтандартнаяОбработка) 
		
	СтандартнаяОбработка = Ложь;
	ПравоПодписиНачалоВыбораСервер(ДанныеВыбора);
	
КонецПроцедуры

&НаКлиенте
Процедура КомандаЗаписатьИЗакрыть(Команда) 
	
	Если Не ЗначениеЗаполнено(Организация) Тогда
		ОбщегоНазначенияКлиент.СообщитьПользователю("Не заполнено поле Организация");
		Возврат;
	КонецЕсли; 
	Если Не ЗначениеЗаполнено(ПравоПодписи) Тогда
		ОбщегоНазначенияКлиент.СообщитьПользователю("Не заполнено поле Право подписи");
		Возврат;
	КонецЕсли;
	Если Не ЗначениеЗаполнено(ОтветственныйСотрудник) Тогда
		ОбщегоНазначенияКлиент.СообщитьПользователю("Ответственный сотрудник");
		Возврат;
	КонецЕсли;
	
	СообщениеОбОшибке = "";
	Результат = СоздатьОбновитьЗаписиРегистраПраваНастройки(Организация,ПравоПодписи,ОтветственныйСотрудник,СообщениеОбОшибке);
	Если Не Результат Тогда
		ОбщегоНазначенияКлиент.СообщитьПользователю(СообщениеОбОшибке);	
	КонецЕсли;	
	
	ОповеститьОВыборе(Результат);

КонецПроцедуры

 #КонецОбласти


#Область ПРОЦЕДУРЫ_ОБРАБОТЧИКИ_СОБЫТИЙ_ФОРМЫ

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка) 
	
	Если ТипЗнч(ЭтаФорма.Параметры) = Тип("ДанныеФормыСтруктура") Тогда
		Для Каждого Реквизит Из ЭтаФорма.ПолучитьРеквизиты() Цикл
			Если ЭтаФорма.Параметры.Свойство(Реквизит.Имя) Тогда
				ЭтаФорма[Реквизит.Имя] = ЭтаФорма.Параметры[Реквизит.Имя];
			КонецЕсли;	
		КонецЦикла;	
	Иначе
		Возврат;
	КонецЕсли  
	
КонецПроцедуры 

#КонецОбласти
